# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors: 4

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SELayer, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, CARAFE, [512,3,2]],
   [-1, 1, Conv, [512, 3, 1]],
   [-1, 1, SpatialGate, [512]],
   [[-1, 6], 1, Mul, [1]],
   [[-1, 6], 1, Sub, [1]],      #14
   [[-1, 6], 1, GAU, [256]],
   [-1, 1, Conv, [512, 3, 2]],

   [6, 1, CARAFE, [256,3,2]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, SpatialGate, [256]],
   [[-1, 4], 1, Mul, [1]],
   [[-1, 4], 1, Sub, [1]],     #19
   [[-1, 4], 1, GAU, [128]],
   [-1, 1, Conv, [256, 3, 2]],

   [4, 1, CARAFE, [128,3,2]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, SpatialGate, [128]],
   [[-1, 2], 1, Mul, [1]],
   [[-1, 2], 1, Sub, [1]],     #24
   [[-1, 2], 1, GAU, [64]],
   [-1, 1, Conv, [128, 3, 2]],


   [2, 1, CARAFE, [64,3,2]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, SpatialGate, [64]],
   [[-1, 0], 1, Mul, [1]],
   [[-1, 0], 1, Sub, [1]],     #24
   [[-1, 0], 1, GAU, [32]],
   [-1, 1, Conv, [64, 3, 2]],



   [10, 1, Conv, [512, 1, 1]],   #25
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, BiFPN_Concat2, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 28


   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, BiFPN_Concat2, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 32 (P3/8-small)


   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2, 38], 1, BiFPN_Concat3, [1]],  # cat backbone P3
   [-1, 3, C3, [128, False]],  # 36 (P3/8-small)


   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 47, 31], 1, BiFPN_Concat3, [1]],  # cat head P4
   [-1, 3, C3, [256, False]],  # 20 (P4/16-medium) 39

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 43,24], 1, BiFPN_Concat3, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)  42

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 39, 17], 1, BiFPN_Concat3, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)  45

   [[50, 53, 56, 59], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
